[
  {
    "id": 1,
    "title": "CODEFEST",
    "date": "Jan 12, 2024",
    "description": "A thrilling two-day coding extravaganza that united bright minds to tackle challenges, spark innovation, and push the boundaries of technology.",
    "imageUrl": "./events-img/one.webp"
  },
  {
    "id": 2,
    "title": "DECODE HOUR",
    "date": "Jan 15, 2024",
    "description": "The flagship two-round Codeathon at SRMIST drew over 600 students, spotlighting talent from diverse academic backgrounds.",
    "imageUrl": "https://placehold.co/390x250/001a36/ffffff?text=Event+2"
  },
  {
    "id": 3,
    "title": "CODE RUSH",
    "date": "Jan 18, 2024",
    "description": "Code Rush was a high-energy competition where participants showcased their coding expertise, solved thrilling challenges, and vied for exciting prizes.",
    "imageUrl": "https://placehold.co/390x250/001a36/ffffff?text=Event+3"
  },
  {
    "id": 4,
    "title": "IDEANOVA",
    "date": "Jan 21, 2024",
    "description": "IdeaNova 2024 was a vibrant ideathon organized by NSCC SRM, bringing together over 200 participants to present creative solutions to real-world problems. With a prize pool of ₹20,000, the event encouraged innovation, collaboration, and impactful idea generation.",
    "imageUrl": "https://placehold.co/390x250/001a36/ffffff?text=Event+4"
  },
  {
    "id": 5,
    "title": "HACK NOVA",
    "date": "Jan 24, 2024",
    "description": "Hack Nova was a hackathon by NSCC SRM with over 500 online and offline participants, bringing together developers and innovators to build creative tech solutions.",
    "imageUrl": "https://placehold.co/390x250/001a36/ffffff?text=Event+5"
  },
  {
    "id": 6,
    "title": "PLACEOPEDIA",
    "date": "Jan 24, 2024",
    "description": "The PlaceOpedia session witnessed the participation of over 100 students. Delivered by our founder Arsh Bhatia, it was an engaging and insightful event that provided valuable guidance on placements, career strategies, and skill development.",
    "imageUrl": "https://placehold.co/390x250/001a36/ffffff?text=Event+5"
  }
]
